import React from "react";
import "./UseTerms.css"
const UseTerms = () => {
    return (
        <div className="use_terms">
            <div className="content" style={{ maxWidth: "1400px", top: "100px", marginBottom: "150px" }}>
                <h1>Условия использования</h1>
                <p>
                    Добро пожаловать на наш веб-сайт, посвященный виртуальным путешествиям по Одессе.
                    Прежде чем использовать наш сайт, ознакомьтесь с нашими условиями использования.
                    Ваше использование сайта означает ваше согласие с этими условиями. Если вы не согласны с ними,
                    пожалуйста, не используйте наш сайт.
                </p>

                <h2>1. Пользовательские обязательства</h2>
                <p>1.1. Вы соглашаетесь использовать наш сайт только в законных целях и соблюдать все применимые законы и нормативные акты.</p>
                <p>1.2. Вы обязуетесь не нарушать права других пользователей и третьих сторон, включая авторские права, товарные знаки, 
                    права конфиденциальности и другие права на интеллектуальную собственность.</p>
                <p>1.3. Вы обязуетесь не использовать наш сайт для распространения незаконного, 
                    оскорбительного, клеветнического, непристойного или иного неподобающего контента.</p>


                <h2>2. Интеллектуальная собственность</h2>
                <p>2.1. Весь контент на нашем сайте, включая тексты, изображения, графику, логотипы и дизайн, 
                    является нашей собственностью или используется нами с разрешения соответствующих правообладателей.
                     Этот контент защищен авторскими правами и другими законами об интеллектуальной собственности.</p>
                <p>2.2. Запрещается воспроизводить, распространять, изменять, публиковать или использовать контент с нашего сайта 
                    без нашего предварительного письменного согласия или согласия соответствующего правообладателя.</p>
        

                <h2>3. Ограничение ответственности</h2>
                <p>3.1. Мы стремимся предоставить точную и актуальную информацию на нашем сайте. 
                    Однако мы не несем ответственности за любые ошибки, неточности или упущения в предоставляемой информации.</p>
                <p>3.2. Мы не несем ответственности за любые убытки, прямые или косвенные, связанные с использованием нашего сайта или его содержимого.</p>
                <p>3.3. Мы оставляем за собой право изменять или прекращать работу сайта или его частей без предварительного уведомления.</p>

                <h2>4. Ссылки на сторонние ресурсы</h2>
                <p>4.1. Наш сайт может содержать ссылки на сторонние веб-сайты или ресурсы, которые находятся вне нашего контроля. 
                    Мы не несем ответственности за содержимое, политику конфиденциальности или практики таких сторонних ресурсов.</p>
                <p>4.2. Вы соглашаетесь использовать сторонние ресурсы на свой страх и риск, 
                    и мы рекомендуем вам ознакомиться с условиями использования и политикой конфиденциальности этих сторонних ресурсов.</p>

                <h2>5. Изменения в условиях использования</h2>
                <p>5.1. Мы оставляем за собой право вносить изменения в настоящие условия использования в любое время. 
                    Любые изменения будут опубликованы на этой странице с указанием даты вступления в силу новых условий.</p>
                <p>5.2. Ваше дальнейшее использование сайта после внесения изменений означает ваше согласие с обновленными условиями использования.</p>

                <h2>6. Связь с нами</h2>
                <p>Если у вас есть вопросы или комментарии относительно наших условий использования, пожалуйста, свяжитесь с нами по указанным контактным данным.</p>
                <p>Дата вступления в силу: [дата]</p>
                <br></br>
                <p style={{ fontSize: "20px", margin: "0" }}>
                    Если у вас возникают вопросы или требуется дополнительная
                    информация о наших Условиях использования, пожалуйста,
                    свяжитесь с нами по указанным контактным данным.
                </p>
            </div>
        </div>
    )
}

export default UseTerms;