import React from "react";
import "./PrivacyPolicy.css"

const PrivacyPolicy = () => {
    return (
        <div className="privacy_policy">
            <div className="content" style={{ maxWidth: "1290px", top: "100px", marginBottom: "150px" }}>
                <h1>Политика конфиденциальности</h1>
                <p>
                    Настоящая Политика конфиденциальности описывает, как мы собираем,
                    используем и защищаем информацию, которую вы предоставляете нам при
                    использовании нашего веб-сайта. Мы стремимся
                    обеспечить конфиденциальность и безопасность вашей личной информации
                    и соблюдаем все применимые законы и нормативные требования в
                    отношении защиты данных. Пожалуйста, внимательно ознакомьтесь с
                    нашей Политикой, чтобы полностью понять, как мы обрабатываем и
                    защищаем вашу информацию.
                </p>

                <h2>1. Собираемая информация</h2>
                <p>1.1. При использовании Сайта мы можем собирать следующую информацию:
                    <p>• Личные данные, такие как имя, адрес электронной почты, номер телефона,
                        которые вы предоставляете добровольно при заполнении форм.</p>
                    <p>• Техническую информацию, включая IP-адрес, тип браузера, операционную систему, сведения
                        о сеансе и другую информацию, связанную с вашим использованием Сайта.</p>
                </p>




                <h2>2. Использование информации</h2>
                <p>2.1. Мы используем собранную информацию для следующих целей:
                    <p>• Предоставления вам доступа к Сайту и его функциям, а также оказания услуг, связанных с ним.</p>
                    <p>• Обработки и ответы на ваши запросы, вопросы или обратную связь.</p>
                    <p>• Улучшения Сайта, анализа его использования и разработки новых функций и услуг.</p>
                    <p>• Обеспечения безопасности, предотвращения мошенничества и соблюдения юридических требований.</p>
                </p>

                <h2>3. Раскрытие информации</h2>
                <p>3.1. Мы не продаем, не арендуем и не передаем вашу личную информацию третьим сторонам без вашего предварительного согласия,
                    за исключением случаев, предусмотренных настоящей Политикой или требованиями закона.</p>
                <p>3.2. Мы можем раскрывать вашу информацию следующим образом:
                    <p>• В случае необходимости сотрудничества с поставщиками услуг, которые помогают нам в предоставлении услуг и функций Сайта.</p>
                    <p>• При соблюдении юридических требований, решении споров, защите наших прав или безопасности, а также соблюдении применимых законов.</p>
                </p>

                <h2>4. Защита информации</h2>
                <p>4.1. Мы предпринимаем все разумные меры для обеспечения безопасности и
                    защиты вашей информации от несанкционированного доступа, использования или раскрытия.
                    Мы применяем технические, административные и физические меры безопасности для защиты информации.
                    Мы ограничиваем доступ к вашей информации только сотрудникам и поставщикам услуг, которым необходимо иметь доступ для выполнения своих обязанностей.</p>

                <h2>5. Ссылки на сторонние ресурсы</h2>
                <p>5.1. Наш Сайт может содержать ссылки на сторонние веб-сайты или ресурсы, которые не контролируются нами.</p>
                <p>5.2. Мы не несем ответственности за содержание, доступность, точность и полноту информации на таких сторонних ресурсах.</p>
                <p>5.3. Ваше использование сторонних ресурсов осуществляется на ваш риск, и вы должны ознакомиться с их собственными политиками конфиденциальности.</p>
                <h2>6. Изменения в Политике конфиденциальности</h2>
                <p>6.1. Мы оставляем за собой право в любое время изменять настоящую Политику конфиденциальности без предварительного уведомления.</p>
                <p>6.2. Изменения вступают в силу с момента их публикации на Сайте.</p>
                <p>6.3. Ваше продолжение использования Сайта после внесения изменений означает ваше согласие с обновленной Политикой конфиденциальности.</p>
                <br></br>
                <p style={{fontSize: "20px" , margin: "0"}}>
                    Если у вас возникают вопросы или требуется дополнительная
                    информация о нашей Политике конфиденциальности, пожалуйста,
                    свяжитесь с нами по указанным контактным данным.
                </p>
            </div>
        </div>
    );
};

export default PrivacyPolicy;
